{
    "__type__": "config_block",
    "__comment__": "This is the top level of the configuration block of parameters. Every subblock represents a specific area of the program that can be configured individually.",
    "config": {
        "window": {
            "__type__": "window_config",
            "__comment__": "These settings modify how the displayed video feed is displayed locally if enabled.",
            "name": {
                "__comment__": "The name of the displayed window. Type String.",
                "value": "CloudGuard"
            },
            "enabled": {
                "__comment__": "Enable/Disable the displayed window. Type Boolean.",
                "value": true
            },
            "overlay_enabled": {
                "__comment__": "Enable/Disable timing specs to be overlaid on each frame. Type Boolean.",
                "value": true
            },
            "font_size_timestamp": {
                "__comment__": "The font size of the overlaid timestamp for each frame. Type Float.",
                "value": 0.5
            },
            "font_size_stats": {
                "__comment__": "The font size of the overlaid stastics for each frame. Type Float.",
                "value": 0.4
            },
            "border_x": {
                "__comment__": "The space between the frame's left edge and the start of text. Type Interger.",
                "value": 20
            },
            "border_y": {
                "__comment__": "The space between the frame's top edge and the start of text. Type Interger.",
                "value": 20
            },
            "spacing_y": {
                "__comment__": "The space between each line of overlaid text. Type Interger.",
                "value": 10
            }
        },
        "camera": {
            "__type__": "camera_config",
            "__comment__": "These settings adjust parameters for the connected camera.",
            "resolution": {
                "__comment__": "The resolution that the camera is set to. Type Interger Array [W,H].",
                "value": [640, 480]
            },
            "fps": {
                "__comment__": "The frame per second that the camera is set to. Type Float.",
                "value": 15
            },
            "rotation": {
                "__comment__": "A rotation angle that is applied immediately after a frame is retrieved from the camera. Type Interger.",
                "value": 0
            },
            "fourcc": {
                "__comment__": "This value gets set to the camera's codec being used. Any initial value for this setting is ignored and is overwritten during initilization.",
                "value": null
            }
        },
        "computing": {
            "__type__": "computing_config",
            "__comment__": "These settings control how much processing is executed for each frame. The balance between quality and speed is tweaked using everything here.",
            "width": {
                "__comment__": "The width that each frame is downsampled to before any processing is done. Interger Type.",
                "value": 240
            },
            "bg_sub_thresh": {
                "__comment__": "The background subtraction threshold for detecting motion. Type Float.",
                "value": 14
            },
            "bg_sub_hist": {
                "__comment__": "The number of previous frames that the adaptive background subtraction model stores. Type Interger.",
                "value": 275
            },
            "threading_enabled": {
                "__comment__": "Enable/Disable the use of multiple threads. This helps to maintain processing the background subtraction while simultaneously uploading data. Type Boolean.",
                "value": true
            },
            "face_detection_enabled": {
                "__comment__": "Enable/Disable face detection using Cascade Classifiers after motion is detected. Type Boolean.",
                "value": false
            },
            "body_detection_enabled": {
                "__comment__": "Enable/Disable body detection using HOG Descriptors after motion is detected. Type Boolean.",
                "value": false
            },
            "last_motion_timeout": {
                "__comment__": "After an initial detection, the program performs deeper analysis for every frame. This sets the timeout value (seconds) for when it should go back into an idle state. Type Interger.",
                "value": 5
            }
        },
        "storage": {
            "__type__": "storage_config",
            "__comment__": "These settings adjust when and how often data is saved. This includes data saved locally, and data sent to an off-site server.",
            "save_cloud_crops": {
                "__comment__": "Enable/Disable uploading detected regions of a frame to an off-site server. Type Boolean.",
                "value": false
            },
            "save_local_crops": {
                "__comment__": "Enable/Disable storing detected regions of a frame on local storage. Type Boolean.",
                "value": false
            },
            "save_local_vids": {
                "__comment__": "Enable/Disable storing a short video H.246 encoded video file on local storage after motion is detected. The end of the video is set according to the 'last_motion_timeout' value. Type Boolean.",
                "value": false
            },
            "encoding_quality": {
                "__comment__": "The level of compression performed on a frame's cropped region before it is stored or sent anywhere. Type Interger.",
                "value": 55
            },
            "min_upload_delay": {
                "__comment__": "When 'save_cloud_crops' is enabled, this sets a delay time for two consecuitive uploads. This is not a hard limit, but rather a recommendation that the program will account for. Type Float.",
                "value": 1.25
            }
        }
    }
}
